TexasInstruments/mspm0-sdk/examples/nortos/LP_MSPM0L2117/motor_control_bldc_sensored_trap_hall/drv8329aevm_gui_firmware/Hall_Trap.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 */
// @cliArgs --device "MSPM0L211X" --package "LQFP-64(PM)" --part "Default"
// @v2CliArgs --device "MSPM0L2117" --package "LQFP-64(PM)"
// @cliArgs --board /ti/boards/LP_MSPM0L2117 --rtos nortos


/**
 * Import the modules used in this configuration.
 */
const ADC12         = scripting.addModule("/ti/driverlib/ADC12", {}, false);
const ADC121        = ADC12.addInstance();
const Board         = scripting.addModule("/ti/driverlib/Board");
const CAPTURE       = scripting.addModule("/ti/driverlib/CAPTURE", {}, false);
const CAPTURE1      = CAPTURE.addInstance();
const GPIO          = scripting.addModule("/ti/driverlib/GPIO", {}, false);
const GPIO1         = GPIO.addInstance();
const GPIO2         = GPIO.addInstance();
const PWM           = scripting.addModule("/ti/driverlib/PWM", {}, false);
const PWM1          = PWM.addInstance();
const PWM2          = PWM.addInstance();
const PWM3          = PWM.addInstance();
const SYSCTL        = scripting.addModule("/ti/driverlib/SYSCTL");
const VREF          = scripting.addModule("/ti/driverlib/VREF");
const ProjectConfig = scripting.addModule("/ti/project_config/ProjectConfig");

/**
 * Write custom configuration values to the imported modules.
 */
ADC121.samplingOperationMode       = "sequence";
ADC121.repeatMode                  = true;
ADC121.trigSrc                     = "DL_ADC12_TRIG_SRC_EVENT";
ADC121.sampleTime0                 = "1us";
ADC121.sampleTime1                 = "1us";
ADC121.$name                       = "GEN_ADC_CHAN_0";
ADC121.adcMem0trig                 = "DL_ADC12_TRIGGER_MODE_TRIGGER_NEXT";
ADC121.adcMem2chansel              = "DL_ADC12_INPUT_CHAN_4";
ADC121.adcMem3chansel              = "DL_ADC12_INPUT_CHAN_7";
ADC121.enabledInterrupts           = ["DL_ADC12_INTERRUPT_MEM3_RESULT_LOADED"];
ADC121.subChanID                   = 1;
ADC121.endAdd                      = 1;
ADC121.adcMem0chansel              = "DL_ADC12_INPUT_CHAN_12";
ADC121.adcMem1chansel              = "DL_ADC12_INPUT_CHAN_13";
ADC121.adcPin12Config.$name        = "ti_driverlib_gpio_GPIOPinGeneric0";
ADC121.peripheral.$assign          = "ADC0";
ADC121.peripheral.adcPin12.$assign = "PA18";
ADC121.peripheral.adcPin13.$assign = "PA17";
ADC121.adcPin13Config.$name        = "ti_driverlib_gpio_GPIOPinGeneric1";

Board.peripheral.$assign          = "DEBUGSS";
Board.peripheral.swclkPin.$assign = "PA20";
Board.peripheral.swdioPin.$assign = "PA19";

CAPTURE1.$name              = "CAPTURE_0";
CAPTURE1.interrupts         = ["CC0_DN"];
CAPTURE1.subscriberPort     = "FSUB0";
CAPTURE1.captSelect         = "Trigger";
CAPTURE1.subscriberChannel  = 2;
CAPTURE1.timerStartTimer    = true;
CAPTURE1.timerPeriod        = "0.5";
CAPTURE1.timerClkDiv        = 8;
CAPTURE1.timerClkPrescale   = 100;
CAPTURE1.peripheral.$assign = "TIMG2";

GPIO1.$name                         = "GEN_GPIO_OUT";
GPIO1.associatedPins.create(2);
GPIO1.associatedPins[0].$name       = "PINO_01";
GPIO1.associatedPins[0].pin.$assign = "PB0";
GPIO1.associatedPins[1].$name       = "PINO_02";
GPIO1.associatedPins[1].pin.$assign = "PB1";

GPIO2.$name                         = "GEN_GPIO_IN";
GPIO2.associatedPins.create(4);
GPIO2.associatedPins[0].$name       = "PINI_01";
GPIO2.associatedPins[0].direction   = "INPUT";
GPIO2.associatedPins[0].interruptEn = true;
GPIO2.associatedPins[0].polarity    = "RISE_FALL";
GPIO2.associatedPins[0].pubChanID   = 2;
GPIO2.associatedPins[0].pin.$assign = "PA7";
GPIO2.associatedPins[1].$name       = "PINI_02";
GPIO2.associatedPins[1].direction   = "INPUT";
GPIO2.associatedPins[1].polarity    = "RISE_FALL";
GPIO2.associatedPins[1].interruptEn = true;
GPIO2.associatedPins[1].pin.$assign = "PA8";
GPIO2.associatedPins[2].$name       = "PINI_03";
GPIO2.associatedPins[2].direction   = "INPUT";
GPIO2.associatedPins[2].polarity    = "RISE_FALL";
GPIO2.associatedPins[2].interruptEn = true;
GPIO2.associatedPins[2].pin.$assign = "PA9";
GPIO2.associatedPins[3].direction   = "INPUT";
GPIO2.associatedPins[3].$name       = "FAULT_1";
GPIO2.associatedPins[3].pin.$assign = "PA14";

PWM1.$name                       = "PWM_0";
PWM1.pwmMode                     = "CENTER_ALIGN";
PWM1.crossTriggerEn              = true;
PWM1.event1ControllerInterruptEn = ["LOAD_EVENT"];
PWM1.interrupts                  = ["ZERO_EVENT"];
PWM1.event1PublisherChannel      = 1;
PWM1.subscriberPort              = "FSUB0";
PWM1.timerStartTimer             = true;
PWM1.timerCount                  = 4000;
PWM1.peripheral.$assign          = "TIMG14";
PWM1.peripheral.ccp0Pin.$assign  = "PA10";
PWM1.peripheral.ccp1Pin.$assign  = "PA11";
PWM1.PWM_CHANNEL_0.$name         = "ti_driverlib_pwm_PWMTimerCC0";
PWM1.PWM_CHANNEL_0.dutyCycle     = 50;
PWM1.PWM_CHANNEL_1.$name         = "ti_driverlib_pwm_PWMTimerCC1";
PWM1.PWM_CHANNEL_1.dutyCycle     = 50;
PWM1.PWM_CHANNEL_1.invert        = true;

PWM2.$name                       = "PWM_1";
PWM2.pwmMode                     = "CENTER_ALIGN";
PWM2.crossTriggerEn              = true;
PWM2.event1ControllerInterruptEn = ["LOAD_EVENT"];
PWM2.crossTriggerAuthority       = "Secondary";
PWM2.timerStartTimer             = true;
PWM2.peripheral.$assign          = "TIMA0";
PWM2.peripheral.ccp0Pin.$assign  = "PA2";
PWM2.peripheral.ccp1Pin.$assign  = "PA22";
PWM2.PWM_CHANNEL_0.$name         = "ti_driverlib_pwm_PWMTimerCC2";
PWM2.PWM_CHANNEL_0.dutyCycle     = 50;
PWM2.PWM_CHANNEL_1.$name         = "ti_driverlib_pwm_PWMTimerCC3";
PWM2.PWM_CHANNEL_1.dutyCycle     = 50;
PWM2.PWM_CHANNEL_1.invert        = true;

PWM3.$name                       = "PWM_2";
PWM3.pwmMode                     = "CENTER_ALIGN";
PWM3.crossTriggerEn              = true;
PWM3.event1ControllerInterruptEn = ["LOAD_EVENT"];
PWM3.crossTriggerAuthority       = "Secondary";
PWM3.timerStartTimer             = true;
PWM3.peripheral.$assign          = "TIMG1";
PWM3.peripheral.ccp0Pin.$assign  = "PA21";
PWM3.peripheral.ccp1Pin.$assign  = "PB7";
PWM3.PWM_CHANNEL_0.$name         = "ti_driverlib_pwm_PWMTimerCC4";
PWM3.PWM_CHANNEL_0.dutyCycle     = 50;
PWM3.PWM_CHANNEL_1.$name         = "ti_driverlib_pwm_PWMTimerCC5";
PWM3.PWM_CHANNEL_1.dutyCycle     = 50;
PWM3.PWM_CHANNEL_1.invert        = true;

SYSCTL.validateClkStatus  = true;
SYSCTL.peripheral.$assign = "SYSCTL";

VREF.peripheral.$assign = "VREF";

ProjectConfig.genDisable         = true;
ProjectConfig.migrationCondition = true;
